Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionOrthogonal Constructor (ViewBase, Point, Point, Point, Point, Point, Double, CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes)
 Creates a new curved dimension with orthogonal reference lines.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CurvedDimensionOrthogonal(
	ViewBase View,
	Point ArcPoint1,
	Point ArcPoint2,
	Point ArcPoint3,
	Point StartPoint,
	Point EndPoint,
	double Distance,
	CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes Attributes
)
Public Sub New (
	View As ViewBase,
	ArcPoint1 As Point,
	ArcPoint2 As Point,
	ArcPoint3 As Point,
	StartPoint As Point,
	EndPoint As Point,
	Distance As Double,
	Attributes As CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes
)
Parameters
View
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
ArcPoint1
Type: Tekla.Structures.Geometry3d.Point
The first arc point to be used.
ArcPoint2
Type: Tekla.Structures.Geometry3d.Point
The second arc point to be used.
ArcPoint3
Type: Tekla.Structures.Geometry3d.Point
The third arc point to be used.
StartPoint
Type: Tekla.Structures.Geometry3d.Point
The start point to be used.
EndPoint
Type: Tekla.Structures.Geometry3d.Point
The end point to be used.
Distance
Type: System.Double
The distance in paper millimeters.
Attributes
Type: Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes
The attributes to be applied.
See Also
Reference
CurvedDimensionOrthogonal Class
CurvedDimensionOrthogonal Overload
Tekla.Structures.Drawing Namespace